vmux0.0.10-pre/ycsbVMs_ycsb_4vms_vmux-dpdk-e810_-1rps_rep0/vm3.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-08-21 17:36:06:167 0 sec: 0 operations; est completion in 0 second 
2024-08-21 17:36:16:019 10 sec: 33904 operations; 3390.4 current ops/sec; est completion in 1 day 11 hours [READ: Count=17007, Max=15415, Min=91, Avg=287.3, 90=409, 99=516, 99.9=2047, 99.99=6367] [UPDATE: Count=16902, Max=22911, Min=89, Avg=284.07, 90=405, 99=520, 99.9=2103, 99.99=4955] 
2024-08-21 17:36:26:018 20 sec: 70951 operations; 3704.7 current ops/sec; est completion in 1 day 9 hours [READ: Count=18437, Max=12679, Min=107, Avg=269.3, 90=395, 99=464, 99.9=534, 99.99=2040] [UPDATE: Count=18605, Max=2423, Min=105, Avg=265.03, 90=392, 99=456, 99.9=520, 99.99=1898] 
2024-08-21 17:36:36:018 30 sec: 109958 operations; 3900.7 current ops/sec; est completion in 1 day 8 hours [READ: Count=19739, Max=9687, Min=111, Avg=257.1, 90=389, 99=468, 99.9=538, 99.99=822] [UPDATE: Count=19268, Max=2115, Min=107, Avg=251.9, 90=385, 99=464, 99.9=531, 99.99=1880] 
2024-08-21 17:36:46:018 40 sec: 157699 operations; 4774.1 current ops/sec; est completion in 1 day 6 hours [READ: Count=23820, Max=8199, Min=110, Avg=209.34, 90=351, 99=462, 99.9=543, 99.99=631] [UPDATE: Count=23921, Max=1950, Min=107, Avg=206.42, 90=352, 99=466, 99.9=551, 99.99=1869] 
2024-08-21 17:36:56:018 50 sec: 190587 operations; 3288.8 current ops/sec; est completion in 1 day 7 hours [READ: Count=16368, Max=3687, Min=109, Avg=303.74, 90=423, 99=508, 99.9=593, 99.99=2657] [UPDATE: Count=16520, Max=2097, Min=107, Avg=300.88, 90=419, 99=504, 99.9=572, 99.99=2020] 
2024-08-21 17:37:06:018 60 sec: 222782 operations; 3219.5 current ops/sec; est completion in 1 day 8 hours [READ: Count=16129, Max=4279, Min=101, Avg=310.18, 90=424, 99=498, 99.9=569, 99.99=2057] [UPDATE: Count=16066, Max=3631, Min=97, Avg=307.49, 90=420, 99=501, 99.9=595, 99.99=1965] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-08-21 17:37:07:032 61 sec: 225668 operations; 2848.96 current ops/sec; est completion in 1 day 8 hours [READ: Count=1430, Max=5487, Min=117, Avg=358.7, 90=488, 99=551, 99.9=4443, 99.99=5487] [CLEANUP: Count=1, Max=1007, Min=1007, Avg=1007, 90=1007, 99=1007, 99.9=1007, 99.99=1007] [UPDATE: Count=1456, Max=850, Min=112, Avg=338.75, 90=459, 99=541, 99.9=647, 99.99=850] 
[OVERALL], RunTime(ms), 61019
[OVERALL], Throughput(ops/sec), 3698.3234730166014
[TOTAL_GCS_Copy], Count, 21
[TOTAL_GC_TIME_Copy], Time(ms), 18
[TOTAL_GC_TIME_%_Copy], Time(%), 0.02949900850554745
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 21
[TOTAL_GC_TIME], Time(ms), 18
[TOTAL_GC_TIME_%], Time(%), 0.02949900850554745
[READ], Operations, 112930
[READ], AverageLatency(us), 269.1949349154343
[READ], MinLatency(us), 91
[READ], MaxLatency(us), 15415
[READ], 95thPercentileLatency(us), 428
[READ], 99thPercentileLatency(us), 495
[READ], Return=OK, 112930
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1007.0
[CLEANUP], MinLatency(us), 1007
[CLEANUP], MaxLatency(us), 1007
[CLEANUP], 95thPercentileLatency(us), 1007
[CLEANUP], 99thPercentileLatency(us), 1007
[UPDATE], Operations, 112738
[UPDATE], AverageLatency(us), 265.4601820149373
[UPDATE], MinLatency(us), 89
[UPDATE], MaxLatency(us), 22911
[UPDATE], 95thPercentileLatency(us), 424
[UPDATE], 99thPercentileLatency(us), 492
[UPDATE], Return=OK, 112738
AUTOTEST_DONE